Revit 2022 API
FabricationServiceButton Properties
The FabricationServiceButton type exposes the following members.
Properties
Name | Description
ButtonIndex
 The button index for this button.
Code
 The code of the button.
ConditionCount
 The number of conditions.
GroupIndex |  Obsolete.
 This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the `PaletteIndex` property instead.
IsAHanger
 Checks if the fabrication service button is hanger.
IsStraight
 Checks if all of the fabrication service button conditions are straights.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The name of the button.
PaletteIndex
 The palette index for this button.
ServiceId
 The fabrication service identifier for the fabrication service this button belongs to.
See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace